def z1():
    countries = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин",
                      "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                      "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава",
                      "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                      "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(countries)
    cap = input("Введите страну")
    print("Страна", cap, "- столица", countries.get(cap))
    print("Отсортированный список:")
    for key in sorted(countries):
        print(key,"-", countries[key])
print(z1())

def z2():
    alp = {
        "а": 1, "б": 3, "в": 1, "г": 3,  "д": 2, "е": 1,  "ё": 3, "ж": 5, "з": 5, "и": 1,  "й": 4,  "к": 2, "л": 2, "м": 2,
        "н": 1, "о": 1, "п": 2,  "р": 1,  "с": 1,  "т": 1,  "у": 2,  "ф": 10, "х": 5, "ц": 5, "ч": 5, "ш": 8,  "щ": 10, "ъ": 10,
        "ы": 4, "ь": 3, "э": 8,  "ю": 8,  "я": 3
    }
    word = input('Введите слово: ')
    price = 0
    for i in word:
        price += alp.get(i)
    print("Стоимость слова:", price)
print(z2())

def z3():
    students = {
        "Петров Иван": ['Русский', 'Английский', 'Французский'],
        "Лебедева Маша": ['Русский', 'Китайский'],
        "Иванов Иван": ['Английский', 'Китайский'],
        "Тихонова Маша": ['Русский'],
    }
    kolvo = set()
    for a in students:
        kolvo.update(students[a])

    sorted_kolvo = sorted(list(kolvo))
    print("Языки, которые знают суденты:", *sorted_kolvo)

    chinese = []
    for a in students:
        if 'Китайский' in students[a]:
            chinese.append(a)
    print("Студенты, знающие китайский:",*chinese)

print(z3())